# SetDistanceToTargetHostFace Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarConstraint..::..SetDistanceToTargetHostFace Method
RebarConstraint Class See Also
---
Sets the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetDistanceToTargetHostFace(
	double offset
)
```

Visual Basic
---
```text
Public Sub SetDistanceToTargetHostFace ( _
	offset As Double _
)
```

Visual C++
---
```text
public:
void SetDistanceToTargetHostFace(
	double offset
)
```

# ### Parameters
offset
    Type: System..::..Double The distance is given as an offset value, the sign of which depends on Host Face direction.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for offset must be no more than 30000 feet in absolute value. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace.' |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace